RTP3512/RTP3535/.svn/pristine/d5/d5bab16f92995f09ee9bad32ec506d0bce6fbcec.svn-base

endPointUrl:http://localhost:8080/patientinfo_war/patientsInfo
Request:
============
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:req="http://www.nhs.org/PatientInfo/v1/schemas/Req">
   <soapenv:Header/>
   <soapenv:Body>
      <req:PatientInfoReq>
         <req:PatientContext>
            <req:requestId>1234</req:requestId>
            <req:sourceName>abc</req:sourceName>
         </req:PatientContext>
         <req:PatientDetails>
            <req:fname></req:fname>
            <req:lname>kumar</req:lname>
            <req:dob>12-10-1996</req:dob>
            <req:gender>m</req:gender>
            <req:patientId>1234</req:patientId>
            <req:age>25</req:age>
            <req:mobnum>123456</req:mobnum>
            <req:address>hyd</req:address>
         </req:PatientDetails>
      </req:PatientInfoReq>
   </soapenv:Body>
</soapenv:Envelope>

Response:
===========
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns2:PatientInfoRes xmlns="http://www.nhs.org/PatientInfo/v1/schemas/Req" xmlns:ns2="http://www.nhs.org/PatientInfo/v1/schemas/Resp">
         <ns2:status>
            <ns2:resCode>pt004</ns2:resCode>
            <ns2:respMsg>Father name is invalid</ns2:respMsg>
         </ns2:status>
      </ns2:PatientInfoRes>
   </S:Body>
</S:Envelope>